# Используем образ Node.js для разработки React-приложения
FROM node:19

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файлы package.json и package-lock.json для React-приложения
COPY package*.json ./

# Устанавливаем зависимости React-приложения
RUN npm install

# Копируем остальные файлы приложения
COPY . .

# Открываем порт 3000, который будет использоваться для разработки React-приложения
EXPOSE 3000

# Команда для запуска вашего приложения в режиме разработки
CMD ["npm", "start"]